<?php

$_['heading_title']         = 'Kонструктор купонов';

// Text
$_['text_success']        = 'Настройки успешно изменены!';
$_['text_sended']         = 'Купоны успешно отправлены!';
$_['text_all']            = 'Все';
$_['text_list']           = 'Список купонов';
$_['text_add']            = 'Добавить';
$_['text_edit']           = 'Редактирование';
$_['text_percent']        = 'Процент';
$_['text_amount']         = 'Фиксированная сумма';
$_['text_coupon']         = 'История купонов';
$_['text_with_link']      = 'По ссылке';
$_['text_customers_groups']= 'Группы клиентов';
$_['text_uses']           = 'Применений';
$_['text_link']           = 'Ссылка';
$_['text_success_sended_coupons']= 'Купоны успешно отправлены!';
$_['text_success_sended_coupon'] = 'Купон успешно отправлен!';
$_['text_you_got_new_coupon'] = 'Вы получили новый купон!';
$_['text_coupon_number']  = 'Купон №';
$_['text_coupon_for']     = 'Купон для';
$_['text_mailing_heading_title']  = 'Здравствуйте уважаемый, %s!';
$_['text_mailing_body']  = 'Вы получили купон %s на скидку. Используйте его в нашем магазине!';
$_['text_link_to_get_coupon']  = 'Ссылка для получения его в нашем магазине!';
$_['text_your_coupon_code']  = 'Ваш код купона: ';

// Entry
$_['entry_name']          = 'Название Купона';
$_['entry_code']          = 'Код';
$_['entry_coupon_count']  = 'Кол-во купонов';
$_['entry_coupon_recive_method'] = 'Способ получения купона';
$_['entry_send']          = 'Отправить купоны клиентам';
$_['entry_customer']      = 'Клиенты';
$_['entry_type']          = 'Тип';
$_['entry_discount']      = 'Скидка';
$_['entry_logged']        = 'Авторизация клиента';
$_['entry_shipping']      = 'Бесплатная доставка';
$_['entry_total']         = 'Сумма';
$_['entry_category']      = 'Категория';
$_['entry_product']       = 'Товары';
$_['entry_date_start']    = 'Дата начала';
$_['entry_date_end']      = 'Дата окончания';
$_['entry_uses_total']    = 'Количество применений купона';
$_['entry_uses_customer'] = 'Количество применений одним клиентом';
$_['entry_status']        = 'Статус';
$_['entry_code_coupon']   = 'Введите код купона';
$_['entry_email']         = 'E-mail';


// Columns
$_['column_name']         = 'Название Купона';
$_['column_code']         = 'Код';
$_['column_discount']     = 'Скидка';
$_['column_date_start']   = 'Дата начала';
$_['column_date_end']     = 'Дата окончания';
$_['column_status']       = 'Статус';
$_['column_order_id']     = '№ Заказа';
$_['column_customer']     = 'Клиент';
$_['column_amount']       = 'Сумма';
$_['column_date_added']   = 'Дата';
$_['column_action']       = 'Действие';
$_['column_link']         = 'Ссылка на купон';

// Confirm
$_['confirm_repair']      = 'Вы уверены, что хотите удалить все ненужные связи?';
$_['confirm_send_coupon'] = 'Отправить купон пользователю?';
$_['confirm_send_coupons']= 'Отправить купоны зарегистрированным пользователям?';
$_['confirm_who_send_coupon'] = 'Кому отправить купон?';

// Help
$_['help_code']           = 'Данный код, клиент вводит для получения скидки.';
$_['help_coupon_count']   = 'Автоматическое создание купонов с уникальным названием и кодом без привязки к клиентам.';
$_['help_customer']       = 'Если привязать клиентов, то купоны будут созданы лично для них. Параметр Кол-во купонов в таком случае игнорируется.';
$_['help_receive_method'] = 'По умолчанию - код купона отправляется клиентам вручную. По ссылке - код купона клиент получает по ссылке.';
$_['help_send']           = 'Если указаны клиенты, то после сохранения купоны отправятся им на почту.';
$_['help_type']           = 'Зависимость от Процента или Фиксированная сумма.';
$_['help_logged']         = 'Клиент должен выполнить вход, чтобы использовать купон.';
$_['help_total']          = 'Минимальная сумма, начиная с которой купон действителен.';
$_['help_category']       = 'Действие купона распространяется на все товары в выбранной категории.';
$_['help_product']        = 'Действие купона распространяется, на выбранный товар (товары). Если товар не выбран, то купон будет действовать на всю корзину';
$_['help_uses_total']     = 'Сколько раз максимально, можно использовать купон. Для бесконечного использования оставить пустым';
$_['help_uses_customer']  = 'Сколько раз максимально, клиент может использовать один купон . Для бесконечного использования оставить пустым';

// Error
$_['error_exists']        = 'Данный код купона уже используется!';
$_['error_coupon_data']   = 'Введите количество купонов или укажите клиентов!';
$_['error_permission']    = 'Вы не имеете прав на редактирование этого модуля.';
$_['error_email']         = 'Неправильный формат E-mail!';
$_['error_empty_email']   = 'Введите E-mail!';

// Button
$_['button_save']           = 'Сохранить';
$_['button_select_all']     = 'Выбрать всех';
$_['button_select_marked']  = 'Выбрать отмеченных';
$_['button_send_coupons']   = 'Отправить купоны';
$_['button_send_coupon']    = 'Отправить купон';
$_['button_repair']         = 'Починить';
